---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.GetEnumerator
source: html/9276b0d2-7770-7ffa-4a2f-e1f83b89e291.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.